In [186]:
import pandas as pd
import numpy as np

pd.DataFrame(data,index,col)

In [187]:
list1 = [[1,2,3,4],[4,5,6,7]]
index = ["a","b"]
col = ["e","f","g","h"]
df = pd.DataFrame(list1,index,col)
df

   e  f  g  h
a  1  2  3  4
b  4  5  6  7

In [188]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),"a b c d".split(),"x y z w".split())
df1

    x   y   z   w
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [189]:
type(df1)

pandas.core.frame.DataFrame

In [190]:
df1['w'] #By columns or df1.w

a     3
b     7
c    11
d    15
Name: w, dtype: int32

In [191]:
df1[['y','w']]

    y   w
a   1   3
b   5   7
c   9  11
d  13  15

In [192]:
df1.loc['a'] #By row

x    0
y    1
z    2
w    3
Name: a, dtype: int32

In [193]:
df1.loc[['a','b']]

   x  y  z  w
a  0  1  2  3
b  4  5  6  7

In [194]:
df1.iloc[2:,1:] #Slicing iloc[row:,col:]

    y   z   w
c   9  10  11
d  13  14  15

In [195]:
df1['f'] = [3,6,7,8] #added col wise, len(list) = no of index
df1

    x   y   z   w  f
a   0   1   2   3  3
b   4   5   6   7  6
c   8   9  10  11  7
d  12  13  14  15  8

In [196]:
dict1 = {'x':np.random.rand(5),'y':np.random.rand(5),'z':np.random.rand(5)} #here keys are used as columns
df2 = pd.DataFrame(dict1,['a','b','c','d','e'])
df2

          x         y         z
a  0.803818  0.330664  0.797434
b  0.420073  0.952207  0.397612
c  0.087694  0.562457  0.949103
d  0.665205  0.485694  0.279461
e  0.707821  0.397801  0.444001

In [197]:
df3 = pd.DataFrame(np.random.randint(1,100,56).reshape(7,8),"a b c d e f g".split(),"x y z w p q r t".split())
df3

    x   y   z   w   p   q   r   t
a  68  50  59  11  91  16  63  53
b  84  37  99  91  68  52   3  27
c  45  79  33  99  26  18  51  66
d  34  21  93  17  24  58  79  49
e  64  36  99  68  74  73  15  62
f  90  96  63  97  28  42  99   2
g  31  48  13  34  44  30   8  23

In [198]:
df3.iloc[4:,4:]

    p   q   r   t
e  74  73  15  62
f  28  42  99   2
g  44  30   8  23

In [199]:
df3['l'] = np.random.randint(1,100,7)
df3

    x   y   z   w   p   q   r   t   l
a  68  50  59  11  91  16  63  53  68
b  84  37  99  91  68  52   3  27  93
c  45  79  33  99  26  18  51  66  40
d  34  21  93  17  24  58  79  49  55
e  64  36  99  68  74  73  15  62  31
f  90  96  63  97  28  42  99   2  73
g  31  48  13  34  44  30   8  23  86

In [200]:
#To reset index
df3.reset_index()

  index   x   y   z   w   p   q   r   t   l
0     a  68  50  59  11  91  16  63  53  68
1     b  84  37  99  91  68  52   3  27  93
2     c  45  79  33  99  26  18  51  66  40
3     d  34  21  93  17  24  58  79  49  55
4     e  64  36  99  68  74  73  15  62  31
5     f  90  96  63  97  28  42  99   2  73
6     g  31  48  13  34  44  30   8  23  86

In [201]:
#To change indexes to any column
df3.set_index("l",inplace=True) #removed and changed to index

In [202]:
df3

     x   y   z   w   p   q   r   t
l
68  68  50  59  11  91  16  63  53
93  84  37  99  91  68  52   3  27
40  45  79  33  99  26  18  51  66
55  34  21  93  17  24  58  79  49
31  64  36  99  68  74  73  15  62
73  90  96  63  97  28  42  99   2
86  31  48  13  34  44  30   8  23

In [203]:
df3.head() #first five indexes

     x   y   z   w   p   q   r   t
l
68  68  50  59  11  91  16  63  53
93  84  37  99  91  68  52   3  27
40  45  79  33  99  26  18  51  66
55  34  21  93  17  24  58  79  49
31  64  36  99  68  74  73  15  62

In [204]:
df3.head(2)#n number of indexes

     x   y   z   w   p   q   r   t
l
68  68  50  59  11  91  16  63  53
93  84  37  99  91  68  52   3  27

In [205]:
df3.tail(2)#last two indexes

     x   y   z   w   p   q   r   t
l
73  90  96  63  97  28  42  99   2
86  31  48  13  34  44  30   8  23

In [206]:
df3.describe()#statistical info
#each row elemnst represent that col's description

,x,y,z,w,p,q,r,t
count,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000
mean,59.428571,52.428571,65.571429,59.571429,50.714286,41.285714,45.428571,40.285714
std,23.436845,26.222491,33.817437,38.383404,26.924055,21.250210,37.558209,23.492653
min,31.000000,21.000000,13.000000,11.000000,24.000000,16.000000,3.000000,2.000000
25%,39.500000,36.500000,46.000000,25.500000,27.000000,24.000000,11.500000,25.000000
50%,64.000000,48.000000,63.000000,68.000000,44.000000,42.000000,51.000000,49.000000
75%,76.000000,64.500000,96.000000,94.000000,71.000000,55.000000,71.000000,57.500000
max,90.000000,96.000000,99.000000,99.000000,91.000000,73.000000,99.000000,66.000000

In [207]:
df3['x'].describe() #particular col info

count     7.000000
mean     59.428571
std      23.436845
min      31.000000
25%      39.500000
50%      64.000000
75%      76.000000
max      90.000000
Name: x, dtype: float64

In [208]:
df3.info() #each col info

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 68 to 86
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       7 non-null      int32
 1   y       7 non-null      int32
 2   z       7 non-null      int32
 3   w       7 non-null      int32
 4   p       7 non-null      int32
 5   q       7 non-null      int32
 6   r       7 non-null      int32
 7   t       7 non-null      int32
dtypes: int32(8)
memory usage: 280.0 bytes

In [209]:
df3['x'].unique() #all unique elements in that particular col

array([68, 84, 45, 34, 64, 90, 31])

In [210]:
df3['x'].value_counts() #count of all elemnts in that particular row

84    1
45    1
90    1
31    1
68    1
34    1
64    1
Name: x, dtype: int64

In [211]:
df3.isnull().any() #if any missing/null elemnts in every col

x    False
y    False
z    False
w    False
p    False
q    False
r    False
t    False
dtype: bool

In [212]:
df3 > 5 #boolean operations directly on DF

       x     y     z     w     p     q      r      t
l
68  True  True  True  True  True  True   True   True
93  True  True  True  True  True  True  False   True
40  True  True  True  True  True  True   True   True
55  True  True  True  True  True  True   True   True
31  True  True  True  True  True  True   True   True
73  True  True  True  True  True  True   True  False
86  True  True  True  True  True  True   True   True

In [213]:
df3.drop('t',axis=1,inplace=True)#remove that particular col

In [215]:
df3.drop(86,inplace=True)#to remove a row

In [216]:
df3

     x   y   z   w   p   q   r
l
68  68  50  59  11  91  16  63
93  84  37  99  91  68  52   3
40  45  79  33  99  26  18  51
55  34  21  93  17  24  58  79
31  64  36  99  68  74  73  15
73  90  96  63  97  28  42  99

In [32]:
df4 = df3[df3 > 6] #elements retained if condition is true. if false it's replaced with NaN
df4

    x     y   z   w   p   q     r     l
a  81  87.0  76  63  35  34   NaN  29.0
b  56   NaN  44  83  30  21  98.0  49.0
c  19  88.0  39  38  35  22  73.0   NaN
d  67  81.0  45  90  80  71  17.0  69.0
e  10  39.0  94  44  64  72  22.0   8.0
g  86  52.0  96  52  31  20  17.0  82.0

In [33]:
df4.isnull().any()

x    False
y     True
z    False
w    False
p    False
q    False
r     True
l     True
dtype: bool

In [34]:
df4.fillna(df4['q'].mean(),inplace=True) #To replace NaN values with mean(can be done with  median,mode(here bif there are two modes then df4['col].mode()[0] - num can be the number of modes))

In [35]:
df4

    x     y   z   w   p   q     r     l
a  81  87.0  76  63  35  34  40.0  29.0
b  56  40.0  44  83  30  21  98.0  49.0
c  19  88.0  39  38  35  22  73.0  40.0
d  67  81.0  45  90  80  71  17.0  69.0
e  10  39.0  94  44  64  72  22.0   8.0
g  86  52.0  96  52  31  20  17.0  82.0

In [36]:
df4.isnull().any()

x    False
y    False
z    False
w    False
p    False
q    False
r    False
l    False
dtype: bool